canyon/canyonCT_neutral/0/c
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -3 0 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    sky
    {
        type            fixedValue;
        value           uniform 0;
    }
    bldgFront
    {
        type            zeroGradient;
    }
    bldgBack
    {
        type            zeroGradient;
    }
    street
    {
        type            fixedGradient;
        gradientOld     uniform 0;
        gradient        nonuniform List<scalar> 
84
(
0
0
0
0
0
0
0
0
...
)
;
    }
}
