canyon/canyonCT_neutral/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.8;

boundaryField
{
    inflow
    {
         type       cyclic;
    }
    outflow
    {
         type       cyclic;
    }
    front
    {
         type       empty;
    }
    back
    {
        type        empty;
    }
    sky
    {
        type        zeroGradient;
    }
    bldgBack
    {
        type        zeroGradient;
    }
    bldgFront
    {
        type        zeroGradient;
    }
    street
    {
        type        zeroGradient;
    }
}


// ************************************************************************* //
