canyon/canyonCT_neutral/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    inflow
    {
         type       cyclic;
    }
    outflow
    {
         type       cyclic;
    }
    front
    {
         type       empty;
    }
    back
    {
        type        empty;
    }
    sky
    {
        type            zeroGradient;
    }
    bldgFront
    {
        type            nutkWallFunction;
        value           uniform 0.375;
    }
    bldgBack
    {
        type            nutkWallFunction;
        value           uniform 0.375;
    }
    street
    {
        type            nutkWallFunction;
        value           uniform 0.375;
    } 
}


// ************************************************************************* //
