canyon/canyonCT_neutral/0/l
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      l;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0 -1 0);

boundaryField
{
    inflow
    {
         type       cyclic;
    }
    outflow
    {
         type       cyclic;
    }
    front
    {
         type       empty;
    }
    back
    {
        type        empty;
    }
    sky
    {
        type        fixedValue;
        value       uniform (0 -1 0);
    }
    bldgFront
    {
        type        fixedValue;
        value       uniform (0 -1 0);
    }
    bldgBack
    {
        type        fixedValue;
        value       uniform (0 -1 0);
    }
    street
    {
        type        fixedValue;
        value       uniform (0 -1 0);
    } 
}


// ************************************************************************* //
