canyon/canyonCT_neutral/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
momentumSource
{
    type            patchMeanVelocityForce;

    selectionMode   all;                    // Apply force to all cells
    
    fields          (U);                    // Name of velocity field
    patch           sky;                    // Name of the patch
    Ubar            (0.2 0 0);             // Desired mean velocity

}


momentumSource
{
    type            meanVelocityForce;

    selectionMode   all;

    fields          (U);
    Ubar            (0.12 0 0);
}
*/

// ************************************************************************* //
