canyon/canyonCT_neutral/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Laminar viscosity
nu              [0 2 -1 0 0 0 0]    1e-05;

// Thermal expansion coefficient
beta            [0 0 0 -1 0 0 0]    3.33e-03;

// Reference temperature
TRef            [0 0 0 1 0 0 0]     0;

// Gravity acceleration
g             [0 1 -2 0 0 0 0]     9.81;

// Laminar Prandtl number
Pr              [0 0 0 0 0 0 0]     0.7; //0.7;

// Turbulent Prandtl number
Prt             [0 0 0 0 0 0 0]     0.7;

// For scalarTransportFoam: diffusion coefficient [m2/s]
DT              DT [0 2 -1 0 0 0 0]    1e-05;

// Laminar Schmidt number
Sc              [0 0 0 0 0 0 0]     0.85;          // cambiare i valori

// Turbulent Schmidt number
Sct             [0 0 0 0 0 0 0]     0.85;

// Brunt-Vaisala frequency
N2             [0 0 -2 0 0 0 0]     0;

// ************************************************************************* //
