canyon/canyonCT_neutral/system/funkySetBoundaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetBoundaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



scalar
{
    field c;
    expressions
    (
        {
            patchName   street;
            target      gradient;
            //variables   "Z=pos().z;X=pos().x";
            //expression  "vector(1,0,0)*( 0.902439*log( mag(altezza)/z0 ) )";
            expression  "(pos().x>0.65 && pos().x<1.35) ? (  0.7142857e05 ) : ( 0 )";
        }
    );
}



// ************************************************************************* //