canyon/canyonCT_neutral/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/
// run: postProcess -func singleGraph -latestTime
/*---------------------------------------------------------------------------*/

start   (1 0 2.0025);        // x = 0.75, 1.00, 1.25 per U e k
end     (1 3 2.0025);        // x = 0.50, 1.00, 1.50 per c
nPoints 1000;

fields  (U k epsilon c);

axis    distance;

// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graphUniform.cfg"
// ************************************************************************* //
